<template>
  <main class="Home">

    <Header />

    <div class="content pa-5" id="content">
      <div class="top-section">
        <router-link to="/"><h1 class="text-center primary--text">مشروع مستشفي دار الطب بالمنصورة</h1></router-link>
        <img src="../assets/img/Details.jpg">
      </div>

      <div class="section" v-for="sec in sectionData" :key="sec.title">
        <h1>{{sec.title}}</h1>
        <p v-for="(par, i) in sec.content" :key="i">{{par}}</p>
      </div>
    </div>
  </main>
</template>

<script>
import Header from '@/components/Header'
import store from '@/store/index'
export default {
  components: {
    Header,
  },

  data() {
    return {
      navHH: store.state.navH,
      sectionData: [
        {
          title: 'موقع المشروع', content: [
          'تم اختيار المشروع بعناية فائقة لكى يحقق اعلى عائد ربحى استثمارى للمستثمر واقل تكلفة فى التنفيذ واعلى جودة تجهيز وتشطيب فقد تم اختيار موقع المشروع على طرق رئيسية لسهولة الوصول اليه, وبمساحة ارض كبيرة تسمح بالتوسعات المستقبلية وكذلك تسمح بانشاء مجتمع عمرانى متكامل حيث تقع ارض المشروع امام كبرى الدراسات بالتجاه المقابل بمساكن الميناء على الطريق الرئيسى.'
        ]
        },
        {
          title: 'نظام المساهمة', content: [
          'ولأن المشروع مطروح للاستثمار بنظام الشركاء المساهمين وبعد دراسة تكاليف المتر المسطح للمستشفيات ولما لنا من سابقة تنفيذ مثل هذا العمل من قبل (مركز المنصورة للجراحة), (مستشفى المصريين باكتوبر), (دار الحكمة بنها) – فقط تم وضع تكاليف للمتر المسطح (انشاء وتشطيب وتجهيز) 15 الف جنيه للمتر وبذلك تكون التكلفة المبدئية 45 مليون جنيه (لاجمالى المسطح المخصص للمستشفى 3000 متر), و يضاف اليها 10% تغيرات فروق اسعار محتملة فى خلال فترة التنفيذ وبذلك تكون اجمالى التكلفة النهائية 49 مليون و 500 الف لاجمالى المشروع وفى حال انخفاض التكاليف وتوفير قيمة 10% يتم صرف اسهم بقيمة ما تم توفيره او وضع ما تم توفيره فى رصيد المساهمين.',
          'سعر السهم 1000 جنيه واقل عدد من الاسهم يمكن شرائه هو 200 سهم يتم سداد قيمتهم على 4 دفعات على فترة سنتين ونصف بحيث يكون السداد متناسبا مع التقدم فى الاعمال وعليه فان المرحلة الاولى للسداد يتم سداد ما قيمته 30% والتى تمثل ثمن الارض فى الطابق المخصص للمستشفى وجزء من تكاليف الانشاءات وبعد عام يتم سداد 30% و يستكمل سداد نسبة ال40%  على عام ونصف وبذلك يكون تم سداد اجمالى حصة كل مساهم علما بان هذا السداد  مرتبط بالتقدم فى اعمال المشروع وبذلك بمجرد سداد ال30% الاولى من المساهم فانه يحصل على عقد الانضمام للمشروع محددا فيه قيمة حصة الارض فى المشروع بما يضمن الحقوق المادية والعينية وفى كل مرحلة سداد ومع  انتهاء كل مرحلة من مراحل جدول الاعمال يتم عقد اجتماع جامعية عمومية للمساهمين للاطلاع على ما تم تنفيذه والبدء فى تحصيل القسط المستحق وبذلك يتم تحقيق الشفافية حفاظا على الحقوق المادية والعينية والقانونية .',
          'للاطلاع على العقود الخاصة بالملكية الارض وصلاحية الارض للبناء  واجراءات الترخيص, كذلك العقود بين المساهمين رجاءا زيارتنا بالمقر الرئيسى.'
        ]
        },
        {
          title: 'الأدارة ونظام العمل فى المشروع',
          content: [
            'يتكون مجلس الادارة من  مساهمين الذى لهم  النسبة الاكبر من الاسهم كذلك فى من يتوفر لهم الخبرات والكفاءات المؤهلة لهذا العمل حيث يتم اختيار وتعيين مدير مسئول عن المشروع وتكوين ادارة لكافة الامور الفنية والمالية والتجهيزية من قبل هذا المجلس وذلك بمجرد الانتهاء من التسليم المبنى كامل التشطيب طبقا لمواصفات وزارة الصحة فى هذا الشأن.',
            'من المعروف ان المستشفيات اما ان تكون تخصصية او عامة ونحن بصدد انشاء مستشفى عامة يوجد بها العديد من التخصصات والعيادات الخارجية عمليات – المناظير – الاشعة – المعمل – صيدلية – حضانه ……. والخ.',
            'فيما يخص العمل الداخلى بالمشروع فالالوية للمساهم بعد ان تنطبق عليه متطلبات شروط العمل.',
            'يتم اسناد العمل المحاسبى الخاص بالمساهمين بدءا من توقيع العقد حتى افتتاح المستشفى الى مكتب محاسبى قانونى للاشراف على اجراءات المالية والقانونية للمشروع.'
          ]
        }
      ]
    }
  },

  mounted() {
    console.log(this.navHH)
  },
}
</script>

<style lang="scss">
@import '../assets/style/config';

.Home {
  position: relative;
  top: -70px;
  width: 100%;
  height: 100%;

  .content {
    margin: 70px 10%;
    background: $grey;
    border-top: 2px solid $primary;
    box-shadow: 5px 5px 20px #3333;
    border-radius: 5px;
  
    .top-section {
  
      h1 {
        margin: 20px auto;
        border-bottom: 3px solid $primary;
        padding: 10px;
        max-width: 60%;
        display: grid;
      }
    
      img {
        margin-top: 50px;
      }
    }
  
    .section {
      margin: 50px 0;
      padding-top: 50px;
  
      border-top: 2px solid $primary;
  
      h1 {
        text-align: center;
        color: $primary;
        padding: 20px 0;
      }
  
      p {
        max-width: 90%;
        margin: 30px auto 0;
        font-size: 1.1em;
        line-height: 1.8;
      }
    } 
  }

}

</style>